In [ ]:
query = """SELECT * FROM users"""

In [ ]:
query = """SELECT id, name FROM customers WHERE status = 'active' ORDER BY name"""

In [ ]:
query = (
    "SELECT o.id, o.date,c.name FROM orders o JOIN customers c ON o.customer_id = c.id"
)

In [ ]:
query = """SELECT
    status,
    count(*)
FROM orders
GROUP BY status
HAVING count(*) > 10"""

In [ ]:
# In a notebook cell
def execute_query(sql):
    # Dummy function
    pass

In [ ]:
execute_query(
    """SELECT
    id,
    name
FROM products
WHERE price > 100"""
)

In [ ]:
user_id = 42
query = f"""SELECT *
FROM users
WHERE id = {user_id}"""

In [ ]:
# In a notebook cell
%%sql
select id, name from users group by 1 order by 2 desc

In [ ]:
# In another cell
%sql SELECT * FROM inventory WHERE quantity < 10

In [ ]:
query = """SELECT id, /* comment */ name
FROM users -- end comment"""

In [ ]:
# In a notebook cell
message = "This is not SQL code."

In [ ]:
# In a notebook cell
query = ""

In [ ]:
# In a notebook cell
path = "/path/to/sql/scripts/select_script.sql"

In [ ]:
query = """SELECT
    id,

    (SELECT max(score)
     FROM scores
     WHERE user_id = u.id) AS max_score
FROM users u
WHERE EXISTS
        (SELECT 1
         FROM orders o
         WHERE o.user_id = u.id)"""

In [ ]:
query = """SELECT
    id,
    USER,
    product
FROM products_master"""